C11/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// The below model was copied over from the /incompressibleFluid/airFoil2D/constant/ tutorial.
viscosityModel  constant;

// Standard density of air at 25C is around 1.293 kg/m^3.
// In order to find absolute pressure Pabs = P*rho + 101325 Pa.
rho             [1 -3 0 0 0 0 0] 1; 

nu              [0 2 -1 0 0 0 0] 1e-05;

// ************************************************************************* //
