C11/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
 =========                 |                                                 
 \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           
  \\    /   O peration     | Version:  13                                    
   \\  /    A nd           | Website:  https://openfoam.org                  
    \\/     M anipulation  |                                                 
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

// Overall Domain dimensions:
// W x L x H = 5.085 m x 2.86 m x 14.92 m
// Room outer geometry:
// W x L x H = 4.920 m x 5.085 m x 2.860 m
// Room inner geometry:
// W x L x H = 4.885 m x 4.720 m x 2.660 m
// Here we use:
// x = length (approximately west -> approximately east)
// y = width  (approximately south -> approximately north)
// z = height (bottom -> top)

// Two conformal blocks matching the STL bounding boxes:
// domainOutside.stl: (-10 -0.1 -0.1) to (0    4.985 2.76)
// domainInside.stl:  (  0 -0.1 -0.1) to (4.92 4.985 2.76)
//
// The x=0 face is shared by both blocks and is therefore internal.

xOutsideMin -10;
xInterface   0;
xInsideMax   4.92;

yMin        -0.1;
yMax         4.965;

zMin        -0.1;
zMax         2.76;

// Target cell sizes. Change these to refine/coarsen both blocks consistently.
dx           0.20; // Started at 0.1; 0.25 worked well.
dy           0.20; // Started at 0.1; 0.25 worked well.
dz           0.20; // Startted at 0.1; 0.25 worked well.

outsideXCells #calc "round(($xInterface - $xOutsideMin)/$dx)";
insideXCells  #calc "round(($xInsideMax - $xInterface)/$dx)";
yCells        #calc "round(($yMax - $yMin)/$dy)";
zCells        #calc "round(($zMax - $zMin)/$dz)";

vertices
(
    // x = -10
    ($xOutsideMin $yMin $zMin) // 0
    ($xOutsideMin $yMax $zMin) // 1
    ($xOutsideMin $yMax $zMax) // 2
    ($xOutsideMin $yMin $zMax) // 3

    // x = 0
    ($xInterface $yMin $zMin) // 4
    ($xInterface $yMax $zMin) // 5
    ($xInterface $yMax $zMax) // 6
    ($xInterface $yMin $zMax) // 7

    // x = 4.92
    ($xInsideMax $yMin $zMin) // 8
    ($xInsideMax $yMax $zMin) // 9
    ($xInsideMax $yMax $zMax) // 10
    ($xInsideMax $yMin $zMax) // 11
);

blocks
(
    hex (0 4 5 1 3 7 6 2)   ($outsideXCells $yCells $zCells) simpleGrading (1 1 1)
    hex (4 8 9 5 7 11 10 6)  ($insideXCells  $yCells $zCells) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    outsideMinX
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }

    insideMaxX
    {
        type patch;
        faces
        (
            (8 9 10 11)
        );
    }

    minY
    {
    	type cyclic;
	neighbourPatch maxY;
	transform translational;
	separationVector (0 -5.065 0);
        //type wall;
        faces
        (
            (0 4 7 3)
            (4 8 11 7)
        );
    }

    maxY
    {
    	type cyclic;
	neighbourPatch minY;
	transform translational;
	separationVector (0 5.065 0);
        //type wall;
        faces
        (
            (1 2 6 5)
            (5 6 10 9)
        );
    }

    minZ
    {
    	type cyclic;
	neighbourPatch maxZ;
	transform translational;
	separationVector (0 0 -2.86);
        //type wall;
        faces
        (
            (0 1 5 4)
            (4 5 9 8)
        );
    }

    maxZ
    {
    	type cyclic;
	neighbourPatch minZ;
	transform translational;
	separationVector (0 0 2.86);
        //type wall;
        faces
        (
            (3 7 6 2)
            (7 11 10 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
